documents/c4/mermaid/DomainModel.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["Component View: Trade Loan Service - Trade Loan Application"]
    style diagram fill:#ffffff,stroke:#ffffff

    subgraph 6 ["Trade Loan Service"]
      style 6 fill:#ffffff,stroke:#0b4884,color:#0b4884

      subgraph 7 ["Trade Loan Application"]
        style 7 fill:#ffffff,stroke:#2e6295,color:#2e6295

        124["<div style='font-weight: bold'>Trade Loan Arrangement</div><div style='font-size: 70%; margin-top: 0px'>[Component: DDD Aggregate Root]</div>"]
        style 124 fill:#ff9800,stroke:#b26a00,color:#000000
        125["<div style='font-weight: bold'>Trade Loan Type</div><div style='font-size: 70%; margin-top: 0px'>[Component: DDD Aggregate Root]</div>"]
        style 125 fill:#ff9800,stroke:#b26a00,color:#000000
        126["<div style='font-weight: bold'>Trade Loan Application</div><div style='font-size: 70%; margin-top: 0px'>[Component: DDD Aggregate Root]</div>"]
        style 126 fill:#ff9800,stroke:#b26a00,color:#000000
        127["<div style='font-weight: bold'>Trade Sanctioned Loan</div><div style='font-size: 70%; margin-top: 0px'>[Component: DDD Aggregate Root]</div>"]
        style 127 fill:#ff9800,stroke:#b26a00,color:#000000
        128["<div style='font-weight: bold'>Trade Loan Facility</div><div style='font-size: 70%; margin-top: 0px'>[Component: DDD Aggregate Root]</div>"]
        style 128 fill:#ff9800,stroke:#b26a00,color:#000000
        129["<div style='font-weight: bold'>Irregular Progressive Disbursement Transaction Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 129 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        130["<div style='font-weight: bold'>Trade Issue Contract Transaction Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 130 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        131["<div style='font-weight: bold'>Trade Lump Sum Disbursement Transaction Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 131 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        132["<div style='font-weight: bold'>Trade Repayment Scheduling Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 132 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        133["<div style='font-weight: bold'>Trade Loan Type Validation Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 133 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        134["<div style='font-weight: bold'>Trade Loan Facility Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 134 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        135["<div style='font-weight: bold'>Trade Sanction Validation Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 135 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
        136["<div style='font-weight: bold'>Trade Loan Facility Validation Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Domain Service]</div>"]
        style 136 fill:#29b6f6,stroke:#1c7fac,color:#ffffff
      end

    end

    128-. "<div></div><div style='font-size: 70%'></div>" .->126
    128-. "<div></div><div style='font-size: 70%'></div>" .->127
    129-. "<div></div><div style='font-size: 70%'></div>" .->126
    129-. "<div></div><div style='font-size: 70%'></div>" .->128
    129-. "<div></div><div style='font-size: 70%'></div>" .->127
    129-. "<div></div><div style='font-size: 70%'></div>" .->125
    130-. "<div></div><div style='font-size: 70%'></div>" .->126
    130-. "<div></div><div style='font-size: 70%'></div>" .->128
    130-. "<div></div><div style='font-size: 70%'></div>" .->125
    130-. "<div></div><div style='font-size: 70%'></div>" .->127
    131-. "<div></div><div style='font-size: 70%'></div>" .->126
    131-. "<div></div><div style='font-size: 70%'></div>" .->128
    131-. "<div></div><div style='font-size: 70%'></div>" .->125
    131-. "<div></div><div style='font-size: 70%'></div>" .->127
    131-. "<div></div><div style='font-size: 70%'></div>" .->124
    133-. "<div></div><div style='font-size: 70%'></div>" .->124
    134-. "<div></div><div style='font-size: 70%'></div>" .->126
    134-. "<div></div><div style='font-size: 70%'></div>" .->128
    134-. "<div></div><div style='font-size: 70%'></div>" .->127
    136-. "<div></div><div style='font-size: 70%'></div>" .->124

  end
